[
	{"name": "Abdul Gaffoor Mosque",
		"category": "PLACES OF WORSHIP",
		"latitude": 1.304368,
		"longitude": 103.853667,
		"description": "Masjid Abdul Gaffoor (Malay) for Abdul Gaffoor Mosque; is a mosque in Singapore. It is located at Dunlop Street in the Rochor Planning Area, within Little India off Jalan Besar. The mosque was constructed in 1907, and major restoration of the buildin..."},
	{"name": "Al­Abrar Mosque",
		"category": "PLACES OF WORSHIP",
		"latitude": 1.280258,
		"longitude": 103.847340,
		"description": "Al­Abrar Mosque is one of the earliest mosques in Singapore, and is located along Telok Ayer Street in the Chinatowndistrict within the Central Area, Singapore's central business district. The mosque is also known by two other names – Kuchu Palli and ..."},
	{"name": "ArtScience Museum",
		"category": "MUSEUMS",
		"latitude": 1.286274,
		"longitude": 103.859266,
		"description": "ArtScience Museum is a museum located within the integrated resort of Marina Bay Sands in the Downtown Core of the Central Area in Singapore. Opened on 17 February 2011 by Singapore's Prime Minister Lee Hsien Loong, it is the world's first ArtScience..."},
	{"name": "Asian Civilisations Museum",
		"category": "HISTORIC LANDMARKS",
		"latitude": 1.287497,
		"longitude": 103.851386,
		"description": "The Asian Civilisations Museum is an institution which forms a part of the four museums in Singapore, the other three being the Peranakan Museum at Old Tao Nan School, the National Museum of Singapore and the Singapore Art Museum.\nIt is one of the pi..."},
	{"name": "Bright Hill Temple (Khong Meng San Phor Kark See Temple)",
		"category": "PLACES OF WORSHIP",
		"latitude": 1.360979,
		"longitude": 103.836175,
		"description": "The Kong Meng San Phor Kark See Monastery, is a Buddhist temple located in Bishan, Singapore. Built by Zhuan Dao in the early 20th century to propagate Buddhism and to provide lodging for monks, this monastery is the largest Buddhist temple in Singap..."},
	{"name": "Buddha Tooth Relic Temple",
		"category": "PLACES OF WORSHIP",
		"latitude": 1.281399,
		"longitude": 103.844268,
		"description": "The Buddha Tooth Relic Temple and Museum is located in the Chinatown district of Singapore and also houses a teahouse and theatre. Though recently built in 2007, the five-storey temple\\’s richly designed interiors and comprehensive exhibits on Buddh..."},
	{"name": "Bukit Timah Nature Reserve",
		"category": "NATURE SITES",
		"latitude": 1.348393,
		"longitude": 103.777463,
		"description": "The Bukit Timah Nature Reserve is a small 1.64 square kilometrenature reserve near the geographic centre of the city-state of Singapore, located on the slopes of Bukit Timah Hill, Singapore's highest hill standing at a height of 163.63 metres, and pa..."},
	{"name": "Cathedral of the Good Shepherd",
		"category": "PLACES OF WORSHIP",
		"latitude": 1.296105,
		"longitude": 103.851109,
		"description": "The Cathedral of the Good Shepherd is the oldest Roman Catholic church in Singapore. It is located in the Museum Planning Area within the Civic District.\nBounded by the parallel Queen and Victoria Streets, and Bras Basah Road, the Cathedral sits with..."},
	{"name": "Central Catchment Nature Reserve",
		"category": "NATURE SITES",
		"latitude": 1.355153,
		"longitude": 103.797202,
		"description": "The Central Catchment Nature Reserveis the largest nature reserve in Singapore, occupying 2880 hectares Forming a large green lung in the geographical centre of the city, it houses several recreational sites, including the Singapore Zoo, the Night Sa..."},
	{"name": "Central Sikh Temple",
		"category": "PLACES OF WORSHIP",
		"latitude": 1.318814,
		"longitude": 103.860554,
		"description": "Central Sikh Temple is the first Sikh gurdwara in Singapore. Established in 1912, the temple had relocated several times before moving to its current site at Serangoon Road at the junction of Towner Road and Boon Keng Road in the Kallang Planning Are..."},
	{"name": "Changi Prison Chapel and Museum",
		"category": "MUSEUMS",
		"latitude": 1.362120,
		"longitude": 103.974034,
		"description": "The Changi Museum is a museum dedicated to Singapore's history during the Second World War and the Japanese occupation of Singapore in particular. In 1988, Singapore built a replica Chapel and Museum next to the Changi Prison. When Changi Prison was ..."},
	{"name": "Chijmes",
		"category": "HISTORIC LANDMARKS",
		"latitude": 1.295059,
		"longitude": 103.852152,
		"description": "CHIJMES is a historic building complex in Singapore, which began life as a Catholic convent known as the Convent of the Holy Infant Jesus and convent quarters known as Caldwell House. The complex is located at Victoria Street in the Downtown Core, wi..."},
	{"name": "Chinatown Heritage Centre",
		"category": "HISTORIC LANDMARKS",
		"latitude": 1.283508,
		"longitude": 103.844352,
		"description": "Restored shophouses displaying living spaces, furnishings & artifacts of early Chinatown settlers. Step back in time at Chinatown Heritage Centre and retrace the footsteps of some of Singapore’s early pioneers. Set within three beautifully-restored s..."},
	{"name": "Chinese and Japanese Gardens",
		"category": "NATURE SITES",
		"latitude": 1.338514,
		"longitude": 103.726199,
		"description": "Chinese and Japanese Gardens, collectively known as the Jurong Gardens, are parks in Jurong East, Singapore and connected by a bridge named the Bridge of Double Beauty. The Chinese Garden concept is based on Chinese gardening art. The Japanese Garden..."},
	{"name": "Chinese Methodist Church",
		"category": "PLACES OF WORSHIP",
		"latitude": 1.278454,
		"longitude": 103.846968,
		"description": "Telok Ayer Chinese Methodist Church is a church located in the Asian nation-city of Singapore belonging to the Chinese Annual Conference of the Methodist Church in Singapore. The church is found at two locations, one (TA1) that is located along Telok..."},
	{"name": "Church of St Gregory the Illuminator",
		"category": "PLACES OF WORSHIP",
		"latitude": 1.293135,
		"longitude": 103.849320,
		"description": "The Armenian Church of Saint Gregory the Illuminator, referred to locally as the Armenian Church, is the oldest Christian church in Singapore, located at Hill Street in the Museum Planning Area, within the Central Area. The church was completed in 18..."},
	{"name": "Crane Dance",
		"category": "TOURIST HOTSPOTS",
		"latitude": 1.258626,
		"longitude": 103.821930,
		"description": "Watch the magical love story between a pair of mechanical cranes and how their love for each other transforms them into real birds. Combining groundbreaking audio and visual technologies, astounding light and water effects, be awed by the cranes' gra..."},
	{"name": "East Coast Park",
		"category": "NATURE SITES",
		"latitude": 1.300784,
		"longitude": 103.912187,
		"description": "The East Coast Park is a beach park stretching from Marina East to Bedok planning areas in the southeastern coast of Singapore. It was opened in the 1970s, when the government completed reclaiming land off the coast at Katong which extends from Changi..."},
	{"name": "Esplanade -­ Theatres on the Bay",
		"category": "TOURIST HOTSPOTS",
		"latitude": 1.289793,
		"longitude": 103.855817,
		"description": "Esplanade – Theatres on the Bay, also known as the Esplanade Theatre or simply The Esplanade, is a 60,000 square metres (6.0 ha) performing arts centre located in Marina Bay near the mouth of the Singapore River. Named after the nearby Esplanade Park..."},
	{"name": "Eu Yan Sang Chinese Medical Hall",
		"category": "CULTURE",
		"latitude": 1.281862,
		"longitude": 103.845167,
		"description": "This shop was named ‘Yan Sang’, which literally means ‘caring for mankind’ in Chinese. With determination and astute foresight, Eu Tong Sen established himself in Malaya and Singapore, and became a leading figure in tin mining and rubber plantation b..."},
	{"name": "Fort Canning Park",
		"category": "HISTORIC LANDMARKS",
		"latitude": 1.294115,
		"longitude": 103.846307,
		"description": "Fort Canning Park is a small hill slightly more than 60 metres high in the southeast portion of the island city-state of Singapore, within the Central Area that forms Singapore's central business district. Although small in physical size, it has a long history intert..."},
	{"name": "Gardens by the Bay",
		"category": "TOURIST HOTSPOTS",
		"latitude": 1.281568,
		"longitude": 103.863613,
		"description": "Gardens by the Bay is a nature park spanning 101 hectaresof reclaimed land in central Singapore, adjacent to the Marina Reservoir. The park consists of three waterfront gardens: Bay South Garden, Bay East Garden and Bay Central Garden. The largest of..."},
	{"name": "Geylang Serai Market",
		"category": "LOCAL DELIGHTS",
		"latitude": 1.316728,
		"longitude": 103.898277,
		"description": "Geylang Serai Market is one of the biggest and busiest wet markets in Singapore. Since 1964, this market has been a focal point for the local Malay community, with a good selection of Malay and Indian-Muslim specialties.The second floor of Geylang Se..."},
	{"name": "G-­Max Reverse Bungy",
		"category": "TOURIST HOTSPOTS",
		"latitude": 1.290504,
		"longitude": 103.846663,
		"description": "If you're looking for extreme things to do in Singapore then join us at the GX-5 extreme swing and trampoline bungy. the extreme swing was designed and created in New Zealand; the home of extreme sports! Furthermore, we proudly have a 100% safety rec..."},
	{"name": "Hajjah Fatimah Mosque",
		"category": "TOURIST HOTSPOTS",
		"latitude": 1.302914,
		"longitude": 103.862853,
		"description": "Masjid Hajjah Fatimah is a mosque located along Beach Road in the Kampong Glam district within the Kallang Planning Area in Singapore. The mosque was designed in a mix of Islamic and European architectural styles, and completed in 1846. The mosque is..."},
	{"name": "Haw Par Villa",
		"category": "TOURIST HOTSPOTS",
		"latitude": 1.283566,
		"longitude": 103.781643,
		"description": "For other gardens of this name see Tiger Balm Garden\nHaw Par Villais a theme park located along Pasir Panjang Road, Singapore. The park contains over 1,000 statues and 150 giant dioramas depicting scenes from Chinese mythology, folklore, legends, hi..."},
	{"name": "HortPark",
		"category": "NATURE SITES",
		"latitude": 1.278736,
		"longitude": 103.801832,
		"description": "HortPark is a 9-hectarepark located in the southwestern part of Singapore. It is billed as the first one-stop gardening lifestyle hub in Asia.\nSituated in the Southern Ridges, HortPark serves as a park connector that allows visitors to travel around..."},
	{"name": "House of Tan Teng Niah",
		"category": "HISTORIC LANDMARKS",
		"latitude": 1.307168,
		"longitude": 103.850992,
		"description": "The Residence of Tan Teng Niah is a brightly colored landmark that stands along the arts belt in Little India. It is the last remaining Chinese villa in history of Little India Singapore. Tan Teng Niah, a successful businessman who owned a confection..."},
	{"name": "Images of Singapore",
		"category": "MUSEUMS",
		"latitude": 1.254047,
		"longitude": 103.817606,
		"description": "Fun, interactive and theatrical, Images of Singapore LIVE takes you on a journey to uncover the nation’s extraordinary story! Through a unique mix of live actors and special effects, get ready to step back in time to Singapore's past from a humble Ma..."},
	{"name": "Istana",
		"category": "MUSUEMS",
		"latitude": 1.306996,
		"longitude": 103.843085,
		"description": "The Istana is the official residence and office of the President of Singapore. Meaning \"palace\" in Malay, it is where the President receives and entertains state guests. The Istana is also the working office of the Prime Minister of Singapore. The cu..."},
	{"name": "Jamae Mosque",
		"category": "PLACES OF WORSHIP",
		"latitude": 1.283158,
		"longitude": 103.845447,
		"description": "Masjid Jamae or Jamae Mosque is one of the earliest mosques in Singapore, and is located on South Bridge Road in the Chinatown district within the Central Area. The mosque was established in 1826. This mosque is also known as Chulia Mosque and Periya..."},
	{"name": "Joo Chiat Street",
		"category": "HISTORIC LANDMARKS",
		"latitude": 1.306348,
		"longitude": 103.904536,
		"description": "Joo Chiat Road is an arterial road and a residential conservation area in the eastern part of Singapore, and is located between Geylang Serai and Marine Parade Road. Before 1917 Joo Chiat Road was known as the Confederate Estate Road. At that time, m..."},
	{"name": "Jurong Bird Park",
		"category": "NATURE SITES",
		"latitude": 1.318707,
		"longitude": 103.706442,
		"description": "Jurong Bird Park is an aviary and tourist attraction in Jurong, Singapore. The bird park, managed by Wildlife Reserves Singapore, covers an area of 0.2 square kilometreson the western slope of Jurong Hill, the highest point in the Jurong region.\nIt ..."},
	{"name": "Katong",
		"category": "CULTURE",
		"latitude": 1.304644,
		"longitude": 103.904497,
		"description": "Katong, also known as Tanjong Katong, is a residential neighbourhood in the eastern portion of the Central Region of Singapore, within Marine Parade planning area. It used to be located by the sea, but land has been reclaimed all the way to East Coas..."},
	{"name": "Kranji War Memorial",
		"category": "HISTORIC LANDMARKS",
		"latitude": 1.418951,
		"longitude": 103.758055,
		"description": "The Kranji War Memorial is located at 9 Woodlands Road, in Kranji in northern Singapore. Dedicated to the men and women from the United Kingdom, Australia, Canada, Sri Lanka, India, Malaya, the Netherlands and New Zealand who died defending Singapore ..."},
	{"name": "Kusu Island",
		"category": "NATURE SITES",
		"latitude": 1.223243,
		"longitude": 103.861119,
		"description": "Kusu Island is one of the Southern Islands in Singapore, located about 5.6 kilometresto the south of the main island of Singapore, off the Straits of Singapore. \"Kusu\" means \"Tortoise Island\" or \"Turtle Island\" in Chinese; the island is also kn..."},
	{"name": "Kwan Im Thong Hood Cho Temple",
		"category": "PLACES OF WORSHIP",
		"latitude": 1.300861,
		"longitude": 103.852998,
		"description": "Kwan Im Thong Hood Cho Temple is a traditional Chinese temple situated at 178 Waterloo Street in Singapore. The temple is of significance to the Chinese in Singapore, and is believed to bring worshippers good luck after praying to the Kuan Yin, or Ava..."},
	{"name": "Lau Pa Sat (Telok Ayer Market)",
		"category": "LOCAL DELIGHTS",
		"latitude": 1.280684,
		"longitude": 103.850444,
		"description": "Lau Pa Sat, also known as Telok Ayer Market, is a historic building located within the Downtown Core in the Central Area of Singapore. It is currently a food centre. There are several shops inside the market such as a 24 hours Cheers Store, a shoe re..."},
	{"name": "Leong San See Temple",
		"category": "PLACES OF WORSHIP",
		"latitude": 1.315197,
		"longitude": 103.856839,
		"description": "Leong San See (long shan si) is a Buddhist temple built in 1917 by Reverand Zhuan Wu, who brought the statue of Guanyin from Nan'an city of Fujian province. The original temple, known then as Leong San Lodge, was a modest building until it was rebuil..."},
	{"name": "Maghain Aboth Synagogue",
		"category": "PLACES OF WORSHIP",
		"latitude": 1.298215,
		"longitude": 103.850807,
		"description": "The Maghain Aboth Synagogue is a synagogue in Singapore. It is located at Waterloo Street in the Rochor Planning Area, within the Central Area in Singapore's central business district.\nThe synagogue was constructed by 1878. It is the oldest Jewish sy..."},
	{"name": "Malay Heritage Centre",
		"category": "HISTORIC LANDMARKS",
		"latitude": 1.302750,
		"longitude": 103.860001,
		"description": "The Malay Heritage Centre is a cultural centre and museum in Singapore that showcases the culture, heritage and history of Malay Singaporeans. Located at Sultan Gate in Kampong Glam, the 8,000 square metrescentre was launched on 27 November 2004.\nThe..."},
	{"name": "Malay Village",
		"category": "MUSEUMS",
		"latitude": 1.316515,
		"longitude": 103.896003,
		"description": "This is a museum in Singapore. For description of Malay villages, see kampung.\nThe Malay Villagewas a museum in Geylang, Singapore where they showcases the life of the Malays who used to live in the area before redevelopment in the 1960s.\nIn the 19..."},
	{"name": "Mandai Orchid Gardens",
		"category": "NATURE SITES",
		"latitude": 1.387183,
		"longitude": 103.728994,
		"description": "Singapore's largest commercial orchid garden. It's worth a visit for the colourful displays and the method and manner of cultivation. The 4-hectare Gardens features a whole hillside covered with flowering orchids in the open sunshine, including Singa..."},
	{"name": "Marina Barrage",
		"category": "NATURE SITES",
		"latitude": 1.280528,
		"longitude": 103.871175,
		"description": "The Marina Barrage is a dam in Singapore built at the confluence of five rivers, across the Marina Channel between Marina East and Marina South. It was officially opened on 1 November 2008. It was Singapore's fifteenth reservoir. It provides water st..."},
	{"name": "Marina Bay Sands Casino",
		"category": "TOURIST HOTSPOTS",
		"latitude": 1.283062,
		"longitude": 103.858781,
		"description": "With three levels of gaming floor-space and over 2500 slot machines to choose from, the casino at Marina Bay Sands offers a vast selection of the newest and most popular electronic gaming machines worldwide. Our collection of machines features more t..."},
	{"name": "Marina Bay Sands SkyPark",
		"category": "TOURIST HOTSPOTS",
		"latitude": 1.283943,
		"longitude": 103.860934,
		"description": "The magnificent Marina Bay Sands is an integrated resort fronting Marina Bay that offers a luxury 2,561-room hotel, an art convention and exhibition center, the Shoppes Mall, an Art & Science museum, two Sands Theatres, seven “celebrity chef” restaur..."},
	{"name": "Maxwell Road Hawker Centre",
		"category": "LOCAL DELIGHTS",
		"latitude": 1.280431,
		"longitude": 103.844822,
		"description": "Maxwell Road Hawker Centre's reputation as a place for delicious foods is spread all over Singapore. This food court has been featured on many television channels for offering excellent authentic local food at reasonable prices. Strategically located..."},
	{"name": "Merlion Park",
		"category": "TOURIST HOTSPOTS",
		"latitude": 1.286789,
		"longitude": 103.854501,
		"description": "Merlion Park, is a Singapore landmark and major tourist attraction, located at One Fullerton, Singapore, near the Central Business District. The Merlion is a mythical creature with a lion's head and the body of a fish that is widely used as a mascot ..."},
	{"name": "Mount Faber Park",
		"category": "NATURE SITES",
		"latitude": 1.273786,
		"longitude": 103.817496,
		"description": "Mount Faber is a hill about 105 metres (344 ft.) in height, located in the town of Bukit Merah in the Central Region of Singapore. It overlooks the Telok Blangah area, and the western parts of the Central Area. The summit is accessible by Mount Fabee..."},
	{"name": "Nagore Durgha Shrine",
		"category": "PLACES OF WORSHIP",
		"latitude": 1.281456,
		"longitude": 103.847881,
		"description": "The Nagore Durgha (or Nagore Dargah) is a shrine in Singapore built by Muslims from southern India between 1828 and 1830, and was originally known as Shahul Hamid Dargha. When this shrine was first built, Telok Ayer Street where the shrine is located..."},
	{"name": "National Museum of Singapore",
		"category": "MUSEUMS",
		"latitude": 1.296638,
		"longitude": 103.848665,
		"description": "The National Museum of Singapore is the oldest museum in Singapore. Its history dates back to 1849, when it was started as a section of a library at Singapore Institution and called the Raffles Library and Museum. After several relocations, in 1887 i..."},
	{"name": "National Orchid Garden",
		"category": "NATURE SITES",
		"latitude": 1.311683,
		"longitude": 103.814901,
		"description": "The National Orchid Garden, located within the Singapore Botanic Gardens, was opened on 20 October 1995 by Singapore's Minister Mentor Lee Kuan Yew.\nThe Singapore Botanic Gardens has been developed along a 3-Core Concept. The three Cores consist of ..."},
	{"name": "NEWater Visitor Centre",
		"category": "educational",
		"latitude": 1.324246,
		"longitude": 103.958677,
		"description": "NEWater, a pillar of Singapore's water sustainability strategy, is high-grade reclaimed water. Produced from treated used water that is further purified using advanced membrane technologies and ultra-violet disinfection, it is ultra-clean and safe to..."},
	{"name": "Old Parliament House",
		"category": "HISTORIC LANDMARKS",
		"latitude": 1.288621,
		"longitude": 103.851085,
		"description": "Old Parliament House or Old Parliament Building may refer to:\nOld Parliament Building\nOld Parliament Building, Colombo, Sri Lanka\nOld Parliament Building, Canada\nOld Parliament House\nOld Parliament House, Athens, Greece\nOld Parliament House, Ca..."},
	{"name": "Peranakan Museum",
		"category": "MUSEUMS",
		"latitude": 1.294367,
		"longitude": 103.849039,
		"description": "The Peranakan Museum is a museum in Singapore specialising in Peranakan culture. A sister museum to the Asian Civilisations Museum, it is the first of its kind in the world, that explores Peranakan cultures in Singapore and other former Straits Settl..."},
	{"name": "Pulau Ubin",
		"category": "NATURE SITES",
		"latitude": 1.412566,
		"longitude": 103.957733,
		"description": "Pulau Ubin, also simply known as Ubin, is an island situated in the north east of Singapore, to the west of Pulau Tekong. Granite quarrying supported a few thousand settlers on Pulau Ubin in the 1960s, but only about a hundred villagers live there to..."},
	{"name": "Raffles Hotel",
		"category": "HISTORIC LANDMARKS",
		"latitude": 1.294883,
		"longitude": 103.854479,
		"description": "Raffles Hotel is a colonial-style luxury hotel in Singapore. It was established by Armenian hoteliers, the Sarkies Brothers, in 1887. The hotel was named after British statesman Sir Thomas Stamford Raffles, the founder of Singapore. It is the flagshi..."},
	{"name": "Raffles Place",
		"category": "TOURIST HOTSPOTS",
		"latitude": 1.284100,
		"longitude": 103.851327,
		"description": "Raffles Place is the centre of the Financial District of Singapore and is located south of the mouth of the Singapore River. It was first planned and developed in the 1820s as Commercial Square to serve as the hub of the commercial zone of Singapore ..."},
	{"name": "Red Dot Design Museum",
		"category": "MUSEUMS",
		"latitude": 1.280147,
		"longitude": 103.856321,
		"description": "The Red Dot Design Museum Singapore is a full glass facade building located on the Marina Bay Waterfront Promenade. Designed by Cox Architects, the building takes on a strong geometrical form and comprises of playful composition of structural steel ...."},
	{"name": "Resort World Sentosa Casino",
		"category": "TOURIST HOTSPOTS",
		"latitude": 1.255179,
		"longitude": 103.821811,
		"description": "Occupying an area of about 15,000sqm in the basement of the Crockfords Tower Hotel, World Resort Casino is one of the most sophisticated casino facilities in the world. Due to its collaboration with some of the world’s leading gaming equipment provid..."},
	{"name": "Sentosa Skyline Luge and Skyride",
		"category": "TOURIST HOTSPOTS",
		"latitude": 1.255179,
		"longitude": 103.821811,
		"description": "Skyline Luge Sentosa is a luge located in Sentosa, Singapore. The attraction opened in the second half of 2005. The luge, situated on the Imbiah Lookout cluster opposite the Tiger Sky Tower, has two tracks. The older one is called the Jungle Trail (6..."},
	{"name": "Singapore Art Museum",
		"category": "MUSEUMS",
		"latitude": 1.297307,
		"longitude": 103.851062,
		"description": "The Singapore Art Museum is a contemporary art museum focusing on art practices in Singapore, Southeast Asia and Asia. Housed in a restored 19th century mission school, it opened in 1996 as the first art museum in Singapore.\nSAM has built an importan..."},
	{"name": "Singapore Bazaar and Flea Market",
		"category": "CULTURE",
		"latitude": 1.302990,
		"longitude": 103.852975,
		"description": "On top of fancy malls and designer labels, Singapore has her fair share of thrift stores and bazaars. Regardless of whether you’re in search of second-hand items, handmade accessories, vintage products or hipster stationery, you’ll find a flea market..."},
	{"name": "Singapore Botanic Gardens",
		"category": "NATURE SITES",
		"latitude": 1.313840,
		"longitude": 103.815914,
		"description": "The Singapore Botanic Gardens is a 158-year-old tropical garden located at the fringe of Singapore's Orchard Road shopping district. It is one of three gardens, and the only tropical garden, to be honoured as a UNESCO World Heritage Site. The Botanic..."},
	{"name": "Singapore Butterfly and Insect Kingdom",
		"category": "NATURE SITES",
		"latitude": 1.255450,
		"longitude": 103.816803,
		"description": "Surrounded with lush tropical greenery, Butterfly Park & Insect Kingdom showcases the stunning beauties of mother nature. With a great variety of fluttering butterflies and exotic insects, this tamed wilderness is sure to delight you. A must-see outd..."},
	{"name": "Singapore Discovery Centre",
		"category": "educational",
		"latitude": 1.332690,
		"longitude": 103.678943,
		"description": "The Singapore Discovery Centre is a 'edutainment' and tourist attraction located in Jurong West, Singapore. The centre includes exhibits which display the history of Singapore as well as an insight on the future.In 1988, the idea of building a museum ..."},
	{"name": "Singapore F1 Grand Prix",
		"category": "TOURIST HOTSPOTS",
		"latitude": 1.305786,
		"longitude": 103.828120,
		"description": "The Singapore Grand Prix is a motor race which forms part of the FIAFormula One World Championship. The event takes place on the Marina Bay Street Circuit and was the inaugural night race and first street circuit in Asia for F1 races. Spaniard Fernan..."},
	{"name": "Singapore Mint Coin Gallery",
		"category": "MUSEUMS",
		"latitude": 1.325414,
		"longitude": 103.739530,
		"description": "An impressive collection of coins, medals and medallions from all over the world is found at the Singapore Mint's exhibition gallery. Visitors can mint their own souvenir coins at the gallery's coin press. The Singapore mint also runs a Singapore Coi..."},
	{"name": "Singapore Navy Museum",
		"category": "MUSEUMS",
		"latitude": 1.317179,
		"longitude": 104.020362,
		"description": "ust beside Changi Naval Base, three kilometres off Changi Coast Road (near the end of Tanah Merah Coast Road and just after SAF Yacht Club), is the Navy Museum. This three-storey museum showcases the history and traditions of the Republic of Singapor..."},
	{"name": "Singapore Night Safari",
		"category": "TOURIST HOTSPOTS",
		"latitude": 1.402187,
		"longitude": 103.788061,
		"description": "The Night Safari is the world's first nocturnal zoo and is one of the most popular tourist attractions in Singapore. The concept of a nocturnal park in Singapore was suggested in the 1980s by the former executive chairman of the Singapore Zoo, Dr Ong..."},
	{"name": "Singapore Philatelic Museum",
		"category": "MUSEUMS",
		"latitude": 1.292845,
		"longitude": 103.848702,
		"description": "The Singapore Philatelic Museum is a museum about the postal history of Singapore and its stamps. The museum, located at 23-B Coleman Street in Singapore, was formerly part of the Anglo-Chinese School, completed in 1906. In the 1970s, the building bec..."},
	{"name": "Singapore River",
		"category": "TOURIST HOTSPOTS",
		"latitude": 1.289117,
		"longitude": 103.840466,
		"description": "The Singapore River is a river that runs parallel to Alexandra Road and feeds into the Marina Reservoir in the southern part of Singapore. The immediate upper watershed of the Singapore River is known as the Singapore River Planning Area, although the..."},
	{"name": "Science Centre Singapore",
		"category": "educational",
		"latitude": 1.333233,
		"longitude": 103.736225,
		"description": "The Science Centre Singapore is a scientific institution in Jurong East, Singapore, specialising in the promotion of scientific and technological education for the general public. With over 850 exhibits spread over eight exhibition galleries, it sees ..."},
	{"name": "Singapore Zoo",
		"category": "TOURIST HOTSPOTS",
		"latitude": 1.404348,
		"longitude": 103.793023,
		"description": "The Singapore Zoo, formerly known as the Singapore Zoological Gardens and commonly known locally as the Mandai Zoo, occupies 28 hectareson the margins of Upper Seletar Reservoir within Singapore's heavily forested central catchment area. The zoo was ..."},
	{"name": "Siong Lim Temple",
		"category": "PLACES OF WORSHIP",
		"latitude": 1.330419,
		"longitude": 103.857315,
		"description": "Siong Lim Temple, also known as Lian Shan Shuang Lin Monastery, is a Buddhist monastery located in Toa Payoh, Singapore. The temple was founded in 1898, but the construction of the premises only began in 1902 by Low Kim Pong and was completed in 1907..."},
	{"name": "Sisters' Islands",
		"category": "NATURE SITES",
		"latitude": 1.214621,
		"longitude": 103.835031,
		"description": "Sisters' Islands are two of the Southern Islands in Singapore and are located to the south of the main island of Singapore, off the Straits of Singapore.\nBig Sister's Island, about 39,000 m2in area and also known as Pulau Subar Laut in Malay, faces ..."},
	{"name": "Songs of the Sea",
		"category": "TOURIST HOTSPOTS",
		"latitude": 1.251168,
		"longitude": 103.816957,
		"description": "Songs of the Sea was a multimedia show located at Siloso Beach on Sentosa Island, Singapore. Designed by ECA2 founder, Yves Pépin, Songs of the Sea started its operations on 26 March 2007, a day after the Sentosa Musical Fountain ceased operatio..."},
	{"name": "Sri Krishnan Temple",
		"category": "PLACES OF WORSHIP",
		"latitude": 1.300567,
		"longitude": 103.852652,
		"description": "Over the years the Sri Krishnan Temple was constructed by several different people managing it until it became one of the top Singapore attractions it is today. Although it is a religious Hindu temple, it draws tourists across all religions and ethni..."},
	{"name": "Sri Mariamman Temple",
		"category": "PLACES OF WORSHIP",
		"latitude": 1.282685,
		"longitude": 103.845130,
		"description": "The Sri Mariamman Temple is Singapore's oldest Hindu temple. It is an agamic temple, built in the Dravidianstyle. Located at 244 South Bridge Road, in the downtown Chinatown district, the temple serves the majority Hindu Singaporeans, Tamilians, in t..."},
	{"name": "Sri Srinivasa Perumal Temple",
		"category": "PLACES OF WORSHIP",
		"latitude": 1.313223,
		"longitude": 103.855922,
		"description": "Sri Srinivasa Perumal Temple or Sri Perumal Temple is one of the oldest temples in Singapore. It is located in Little India on Serangoon Road, where its tall Gopuramshows the different incarnations of Lord Vishnu. This large complex, dedicated to Vis..."},
	{"name": "Sri Thandayuthapani Temple",
		"category": "PLACES OF WORSHIP",
		"latitude": 1.294322,
		"longitude": 103.843047,
		"description": "The Sri Thendayuthapani Temple, better known as the Chettiars' Temple or the Tank Road temple, is one of the Singapore Hindu community's most important monuments. It was gazetted as a national monument on 21 October 2014. It was built in 1859 by Natt..."},
	{"name": "Sri Veeramakaliamman Temple",
		"category": "PLACES OF WORSHIP",
		"latitude": 1.307883,
		"longitude": 103.852443,
		"description": "Sri Veeramakaliamman Templeis a Hindu temple located in the middle of Little India in the southern part of Singapore.\nThe Sri Veeramakaliamman Temple is dedicated to the Hindu goddess Kali, fierce embodiment of Shakti and the god Shiva's wife, Parva..."},
	{"name": "St Andrew's Cathedral",
		"category": "PLACES OF WORSHIP",
		"latitude": 1.292274,
		"longitude": 103.852199,
		"description": "St. Andrew's Cathedral, or the Cathedral Church of St. Andrew, may refer to:\nIn Australia:\nSt Andrew's Cathedral, Sydney\nIn Canada:\nSt. Andrew's Cathedral\nIn England:\nRochester Cathedral, before 1642\nWells Cathedral, otherwise the Cathedral Ch..."},
	{"name": "St John's Island",
		"category": "NATURE SITES",
		"latitude": 1.216667,
		"longitude": 103.850000,
		"description": "Saint John's Island, previously known as Pulau Sakijang Bendera, is one of the Southern Islands in Singapore. It is located approximately 6.5 km to the south of the main island of Singapore, off the Straits of Singapore. Saint John's Island formerly ..."},
	{"name": "Statues of Sir Stamford Raffles",
		"category": "HISTORIC LANDMARKS",
		"latitude": 1.287722,
		"longitude": 103.850755,
		"description": "The statue of Singapore's founder, Sir Stamford Raffles, cast in dark bronze by Thomas Woolner stands in front of Victoria Theatre. Its replica, made of pure white polymarble stands at North Boat Quay, at an area colloquially known as Raffles Landing..."},
	{"name": "Sultan Mosque",
		"category": "PLACES OF WORSHIP",
		"latitude": 1.302242,
		"longitude": 103.859035,
		"description": "With its massive golden domes and huge prayer hall, Sultan Mosque is a must-see if you’re in the historic Kampong Glam district. Masjid Sultan, as it is also known, is a prominent mosque in Singapore and one of the country’s most impressive religious..."},
	{"name": "Sungei Buloh Nature Park",
		"category": "NATURE SITES",
		"latitude": 1.446719,
		"longitude": 103.730149,
		"description": "The Sungei Buloh Wetland Reserve is a nature reserve in the northwest area of Singapore. It is the first wetlands reserve to be gazetted in Singapore (2002), and its global importance as a stop-over point for migratory birds was recognised by the inc..."},
	{"name": "Supreme Court & City Hall",
		"category": "TOURIST HOTSPOTS",
		"latitude": 1.290677,
		"longitude": 103.850759,
		"description": "The City Hall in Singapore is a national monument gazetted on 14 February 1992. It can be found in front of historical Padang and adjacent to the Supreme Court of Singapore, it was designed and built by the architects of the municipal government, A.... "},
	{"name": "Temple of 1,000 Lights (Sakyamuni Buddha Gaya Temple)",
		"category": "PLACES OF WORSHIP",
		"latitude": 1.314743,
		"longitude": 103.856975,
		"description": "The Sakya Muni Buddha Gaya Temple is one of the most prominent and widely visited Buddhist temples in Singapore, often referred to as the Temple of 1,000 Lights. It features a 15-meter high statue of a seated Buddha, which weighs nearly 300 tons, as ..."},
	{"name": "The Padang",
		"category": "CULTURE",
		"latitude": 1.290556,
		"longitude": 103.853044,
		"description": "The Padang (Malay for 'field') is an open playing field located within the Downtown Core of the Central Area in Singapore. It includes the Padang Cricket Ground. The Padang is surrounded by several important landmarks, which include Saint Andrew's Ca..."},
	{"name": "The Southern Ridges",
		"category": "NATURE SITES",
		"latitude": 1.280102,
		"longitude": 103.802995,
		"description": "The Southern Ridges is a 10-kilometre stretch of green open spaces spanning the hills of some of Singapore’s most popular parks and gardens, connected by picturesque ridges and pathways. Imagine walking across a bridge 36-metres above the road connec..."},
	{"name": "Thian Hock Keng Temple",
		"category": "PLACES OF WORSHIP",
		"latitude": 1.281087,
		"longitude": 103.847477,
		"description": "Thian Hock Keng (literally \"Palace of Heavenly Happiness\"), also known as the Tianfu Temple, is a temple of Mazu (\"Ma Cho Po\"), a Chinese sea goddess, located in Singapore. It is the oldest and most important temple of the Hokkien (Hoklo) people ..."},
	{"name": "Treetop Walk at MacRitchie Reservoir",
		"category": "NATURE SITES",
		"latitude": 1.344762,
		"longitude": 103.822351,
		"description": "The TreeTop Walk (TTW) is the highlight of several long hiking routes in MacRitchie that brings you through the different stages of a mature secondary forest. The first of its kind in Singapore and in the region, this free-standing suspension bridge ..."},
	{"name": "Underwater World",
		"category": "TOURIST HOTSPOTS",
		"latitude": 1.258183,
		"longitude": 103.811225,
		"description": "Underwater World may refer to:\nUnderwater World, Singapore - oceanarium in Singapore\nUnderWater World, Queensland - marine mammal park, oceanarium and wildlife sanctuary in Queensland, Australia\nUnderWater World Guam - oceanarium in Guam\nKelly Ta..."},
	{"name": "Universal Studios Singapore",
		"category": "TOURIST HOTSPOTS",
		"latitude": 1.254042,
		"longitude": 103.823808,
		"description": "Universal Studios Singapore is a theme park located within Resorts World Sentosa on Sentosa Island, Singapore. It was a key component of Genting's bid for the right to build Singapore's second integrated resort. On 8 December 2006, the Singapore gove..."},
	{"name": "Wonder Full at Marina Bay Sands",
		"category": "TOURIST HOTSPOTS",
		"latitude": 1.284208,
		"longitude": 103.858233,
		"description": "At least twice a night, the Marina Bay waterfront comes alive with gleaming lasers, billowing water fountains and flashing pyrotechnics, all set to a moving orchestral soundtrack. These are just the sights and sounds of Wonder Full, the award-winning..."},
	{"name": "Vivo City",
		"category": "TOURIST HOTSPOTS",
		"latitude": 1.264282,
		"longitude": 103.822158,
		"description": "Vivo City is the largest shopping mall in Singapore. It was designed by internationally acclaimed Japanese architect Toyo Ito, inspired by the HarbourFront location of the development, which evokes images of waves in the sea. Each space leads intuitiv..."},
	{"name": "Singapore Flyer",
		"category": "TOURIST HOTSPOTS",
		"latitude": 1.289299,
		"longitude": 103.863137,
		"description": "At a height of 165m, Singapore Flyer is one of the world’s largest Giant Observation Wheel and also one of Asia’s biggest tourist attractions. promises more than just a view, but a panorama that captures Marina Bay’s skyline with a glimpse of neighbo..."},
	{"name": "Gardens By the Bay",
		"category": "NATURE SITES",
		"latitude": 1.281568,
		"longitude": 103.863613,
		"description": "Gardens by the Bay is a nature park spanning 101 hectares (250 acres) of reclaimed land in central Singapore, adjacent to the Marina Reservoir. The park consists of three waterfront gardens: Bay South Garden, Bay East Garden and Bay Central Garden. T..."},
	{"name": "People of the River Statue Series",
		"category": "HISTORIC LANDMARKS",
		"latitude": 1.290602,
		"longitude": 103.846474,
		"description": "One of the most pleasant things to do in Singapore is a stroll by the Singapore River. The river area, particularly Boat Quay and Clarke Quay, were important centres in the history of Singapore’s trade. It was here that merchants unloaded their vesse..."}
]